export const Copyright = () => {
	return (
		<section className='p-3'>
			<h1>Авторские права</h1>
			<p>
				Весь контент, размещённый на сайте <strong>ВАШ_САЙТ.РФ</strong>,
				включая, но не ограничиваясь: текстами, изображениями, логотипами,
				иконками, элементами дизайна, программным кодом, а также структурой и
				компоновкой страниц — является интеллектуальной собственностью владельца
				сайта и охраняется в соответствии с законодательством РФ и
				международными соглашениями об авторском праве.
			</p>

			<h2>1. Использование материалов</h2>
			<ul>
				<li>
					Запрещается копировать, распространять, публиковать или использовать
					любой контент с сайта без письменного разрешения правообладателя.
				</li>
				<li>
					Допускается частичное цитирование с обязательной активной гиперссылкой
					на оригинальный источник (<strong>ВАШ_САЙТ.РФ</strong>), если это не
					искажает смысл материала.
				</li>
			</ul>

			<h2>2. Авторский код</h2>
			<p>
				Весь программный код, размещённый на сайте, включая интерфейсные
				компоненты, анимации, API и backend-логику, является результатом
				авторской разработки и не подлежит копированию, адаптации или интеграции
				в сторонние проекты без явного согласия автора.
			</p>

			<h2>3. Нарушения</h2>
			<p>
				При выявлении фактов незаконного использования материалов с сайта,
				администрация оставляет за собой право на защиту своих интересов в
				судебном порядке, включая возмещение убытков и компенсацию морального
				вреда.
			</p>

			<h2>4. Контакты по вопросам авторских прав</h2>
			<p>
				Если вы хотите использовать какой-либо материал с сайта на законных
				основаниях, пожалуйста, свяжитесь с нами:
			</p>
		</section>
	);
};
